import { useEffect } from 'react'
import './index.less'
import { setTitle } from '@/utils/setTitle'
const MemberServiceProtocol = () => {
  useEffect(() => {
    setTitle('基金理财助手小程序服务协议')
  }, [])
  return (
    <div className="container">
      <h2>基金理财助手小程序服务协议</h2>
      <hr color="#E9EAEF" style={{ height: 1.0, transform: `scaleY(.5)` }} />
      <p>
        基金理财助手套餐服务是有偿的增值服务,您须完全同意下列所有服务条款并完成付费,才能享受相关服务。
      </p>
      <h3>1.总则</h3>
      <p>
        1.1.基金理财助手是由玄元保险代理有限公司及其关联方(北京口袋财富信息科技有限公司)创建和运营的微信小程序。
      </p>
      <p>
        1.2.基金理财助手用户是指完成全部注册流程,愿意接受基金理财助手用户协议并在基金理财助手微信小程序相关使用规范的规定下使用基金理财助手服务的注册用户。
      </p>
      <p>
        1.3.基金理财助手套餐服务是基金理财助手小程序为基金理财助手用户提供的有偿增值服务,用户在基金理财助手小程序支付相关费用后,方可享受套餐内的各项服务。
      </p>
      <h3>2.服务费用</h3>
      <p>
        2.1.标准资费请见支付页面，基金理财助手小程序将根据用户购买套餐的不同提供不同幅度的优惠,具体优惠信息以套餐支付页上内容为准。本服务的服务期限及服务内容以您自行选择并支付相应套餐为准,您也可以登录基金理财助手小程序-我的页面查看自己的服务期限。
      </p>
      <p>
        2.2.基金理财助手小程序有权根据实际情况随时调整费用标准,对于基金理财助手小程序套餐服务资费标准的调整,基金理财助手小程序将提前7天进行公示,并在约定之日起生效。在约定日期前按原资费标准购买服务的用户,其服务享有资格及套餐服务在资费调整前购买的服务期限内不受影响且无需补充缴纳差额;在约定日期后购买基金理财助手小程序套餐服务的用户,应按照更新后的资费标准进行支付。
      </p>
      <h3>3.服务内容</h3>
      <p>
        3.1.基金理财助手小程序将为付费用户提供多种专有的增值服务,具体内容以支付页面显示信息为准。
      </p>
      <p>3.2.基金理财助手小程序有权根据实际情况随时调整服务内容。</p>
      <p>3.3基金理财助手小程序有权根据实际情况随时调整功能的策略及模型。</p>
      <h3>4.服务的开通和终止</h3>
      <p>4.1.本服务开通之后,不可进行转让,付费3天后不可退订。</p>
      <p>4.2.您不得通过以下任何方式为自己或他人开通本服务:</p>
      <p>4.2.1.以营利、经营等非个人使用的目的为自己或他人开通本服务;</p>
      <p>
        4.2.2.通过任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件等任何程序、软件方式为自己或他人开通本服务;
      </p>
      <p>4.2.3.通过任何不正当手段或以违反诚实信用原则的方式为自己或他人开通本服务;</p>
      <p>4.2.4.通过非基金理财助手小程序指定的方式为自己或他人开通本服务;</p>
      <p>4.2.5.通过侵犯基金理财助手小程序或他人合法权益的方式为自己或他人开通本服务;</p>
      <p>
        4.2.6.通过其他违反相关法律、行政法规、国家政策等的方式为自己或他人开通本服务。 4.3.服务期限
      </p>
      <p>4.3.1.本服务的服务期限以您自行选择并支付相应服务费用的期限为准。</p>
      <p>
        4.3.2.套餐过期后,基金理财助手小程序将终止提供套餐增值服务，用户需要在套餐有效期内解锁基金买卖信号，买卖信号有效期根据不同套餐信号时长不同。
      </p>
      <p>
        4.3.3.由于实名认证的需要,用户在服务有效期内解除、修改绑定手机号,可能会造成套餐服务被终止。
      </p>
      <p>4.3.4.用户在购买套餐后套餐立即激活，有效期以套餐对应期限为准。</p>
      <p>
        4.3.5用户在购买套餐后解锁基金买卖信号，若在套餐有效期内延长基金买卖信号有效期的，基金买卖信号的有效期将在套餐服务的有效期基础上延长。
      </p>
      <p>
        4.3.6用户在购买套餐后被赠送的大礼包增值服务有效期，同当前用户购买的套餐中最晚到期的套餐有效期相同。
      </p>
      <h3>5.付费用户的权利和义务</h3>
      <p>
        5.1.付费用户应确保注册资料的真实性。如因注册信息不真实所带来的后果及责任,由用户自行承担。
      </p>
      <p>
        5.2.付费用户根据购买不同的套餐享有基金理财助手小程序不同服务的权利,同时应遵守基金理财助手小程序的各项管理方案,包括但不限于基金理财助手小程序用户服务协议。
      </p>
      <p>5.3.付费用户在付费的套餐有效期内享受基金理财助手小程序套餐内的各项增值服务。</p>
      <p>5.4.付费用户可优先参加由基金理财助手小程序组织的活动并享受对应的优惠及增值服务。</p>
      <p>5.5.付费用户有权利不参加基金理财助手小程序组织的任何活动。</p>
      <h3>6.基金理财助手小程序的权利和义务</h3>
      <p>
        6.1.基金理财助手小程序有义务保证付费服务的顺畅,当出现技术故障导致付费服务提供有碍时,基金理财助手小程序应尽快排除故障。
      </p>
      <p>
        6.2.基金理财助手小程序在未经付费用户授权时不得公开、编辑或透露付费用户的注册及保存的非公开内容，法律允许的情形除外。
      </p>
      <p>
        6.3.基金理财助手小程序通过系统通知、短信通知、邮件通知等多种方式对付费用户进行通知和公告。
      </p>
      <p>
        6.4.因不可抗力造成服务的中断或其它缺陷,基金理财助手小程序不承担任何责任，但将尽力减少因此给付费用户造成的损失和影响。
      </p>
      <p>
        6.5.因用户原因造成基金理财助手小程序账号密码泄露,基金理财助手小程序不承担责任,同时为避免基金理财助手小程序账号被盗用后滥用而引起法律风险,基金理财助手小程序有权在知悉该情形后采取一切措施避免第三方对用户的账号实施操作行为,而不论其基于何种目的、获取方式是否善意合法。
      </p>
      <p>
        6.6.若付费用户在使用基金理财助手小程序的过程中,故意实施有损基金理财助手小程序、基金理财助手小程序用户的合法权益的行为,基金理财助手小程序有权取消该用户的套餐服务资格而无需给予任何补偿,并保留进一步追究该行为法律责任的权利。
      </p>
      <p>
        6.7.若付费用户在使用基金理财助手小程序的过程中,存在触犯中华人民共和国法律法规的行为,基金理财助手小程序有权取消该用户的套餐服务资格而无需给予任何补偿,行为人须自行承担全部责任。
      </p>
      <h3>7.其他</h3>
      <p>7.1.本服务条款的解释,效力及纠纷的解决,适用于中华人民共和国大陆法律。</p>
      <p>
        7.2.基金理财助手小程序可依照基金理财助手小程序发展的不同阶段,随着基金理财助手小程序管理经验的不断丰富,出于维护基金理财助手小程序秩序的目的,不断完善本条款。
      </p>
      <p>
        7.3.所有基金理财助手小程序付费用户必须完成用户注册程序并同意本协议的全部内容。若您不同意本协议的任何内容，请您停止使用基金理财助手小程序套餐服务，若您继续使用套餐服务，视为您同意本协议的全部内容。
      </p>
    </div>
  )
}
export default MemberServiceProtocol
